{
    "basics": {
        "name": "Julian Smith",
        "label": "Full-Stack Developer",
        "email": "JULIAN.MS.DEV@GMAIL.COM",
        "location": {
            "city": "Indiana",
            "countryCode": "US"
        },
        "summary": "Multifaceted Full-Stack Developer & Technical Lead with 11+ years of experience across software engineering, network infrastructure, and mission-critical satellite communications. Expert in .NET, SQL Server, and modern JavaScript frameworks (React, Next.js). A Marine Corps veteran with a proven track record of managing $2B in assets and leading complex technical operations."
    },
    "work": [
        {
            "name": "Steel Dynamics",
            "position": "Programmer",
            "startDate": "2022-01",
            "endDate": "2023-01",
            "type": "dev",
            "summary": "Spearheaded the modernization of legacy internal tools into robust, scalable enterprise web applications using the .NET ecosystem.",
            "highlights": [
                "Architected and optimized high-performance SQL Server (T-SQL) reporting systems, reducing data retrieval time by 40% for the sales department.",
                "Designed and implemented responsive, user-centric front-end interfaces using modern JavaScript and CSS, improving user adoption.",
                "Played a key role in Agile sprint planning and execution, translating complex stakeholder requirements into deployable software solutions."
            ]
        },
        {
            "name": "Expedition Communications",
            "position": "Network Installation Technician",
            "startDate": "2020-06",
            "endDate": "2022-06",
            "type": "network",
            "summary": "Orchestrated critical network infrastructure deployments and logistics for high-availability commercial clients.",
            "highlights": [
                "Achieved 100% on-time project completion rate through rigorous inventory management and logistical planning.",
                "Performed expert-level troubleshooting and resolution of complex connectivity issues in remote and challenging environments.",
                "Configured and validated enterprise-grade routers, switches, and satellite modems."
            ]
        },
        {
            "name": "DIRECTV",
            "position": "Field Service Technician",
            "startDate": "2016-01",
            "endDate": "2019-01",
            "type": "satcom",
            "summary": "Delivered premium technical service and installation for residential and commercial satellite systems.",
            "highlights": [
                "Consistently maintained top-tier customer satisfaction ratings (CSAT) by providing clear, non-technical system education to users.",
                "Diagnosed and repaired signal degradation issues, optimizing system performance across diverse physical installations."
            ]
        },
        {
            "name": "United States Marine Corps",
            "position": "Network / Satellite Technician",
            "startDate": "2010-07",
            "endDate": "2014-07",
            "type": "mil",
            "summary": "Commanded the operation and maintenance of tactical communication assets valued at over $2 billion in high-stakes environments.",
            "highlights": [
                "Led rapid-response deployment teams to establish secure voice and data networks in austere locations.",
                "Mentored and trained junior Marines in technical proficiency, operational safety, and leadership protocols.",
                "Engineered ad-hoc field solutions to restore mission-critical connectivity under combat conditions."
            ]
        }
    ],
    "education": [
        {
            "institution": "San Diego Global Knowledge University",
            "area": "Full Stack Development",
            "studyType": "Certificate",
            "courses": [
                "Algorithms",
                "React",
                "Python"
            ]
        },
        {
            "institution": "Mira Costa College",
            "area": "Computer Science",
            "studyType": "Three Years No Degree",
            "courses": [
                "Computer Science",
                "Graphic Design"
            ]
        }
    ],
    "skills": [
        {
            "name": "Software Development",
            "keywords": [
                ".NET Framework",
                "C#",
                "ASP.NET MVC",
                "Web API",
                "SQL Server",
                "React",
                "Next.js",
                "JavaScript (ES6+)",
                "CSS3",
                "HTML5",
                "Rust"
            ]
        },
        {
            "name": "Networking & Infrastructure",
            "keywords": [
                "Cisco",
                "Juniper Networks",
                "SATCOM",
                "Network Topology Design"
            ]
        },
        {
            "name": "Leadership & Operations",
            "keywords": [
                "Agile/Scrum",
                "Team Leadership",
                "Logistics Management"
            ]
        }
    ]
}